
# tap repositories and their packages

tap 'homebrew/core'
brew 'aircrack-ng'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'autopano-sift-c'
brew 'aws-elasticbeanstalk'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'bash-completion'
brew 'bdw-gc'
brew 'bison'
brew 'boost'
brew 'brotli'
brew 'c-ares'
brew 'cabal-install'
brew 'cairo'
brew 'carthage'
brew 'ceres-solver'
brew 'circleci'
brew 'cmake'
brew 'cmu-pocketsphinx', args: ['HEAD']
brew 'cmu-sphinxbase', args: ['HEAD']
brew 'coreutils'
brew 'curl'
brew 'dav1d'
brew 'direnv'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker'
brew 'double-conversion'
brew 'doxygen'
brew 'e2fsprogs'
brew 'eigen'
brew 'eksctl'
brew 'elixir'
brew 'erlang'
brew 'exiftool'
brew 'fabric'
brew 'ffmpeg'
brew 'flac'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'gawk'
brew 'gcc'
brew 'gd'
brew 'gdb'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gflags'
brew 'ghc'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'gitlab-runner'
brew 'gl2ps'
brew 'glew'
brew 'glib'
brew 'glog'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-prolog'
brew 'gnu-sed'
brew 'gnuplot'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gperf'
brew 'gperftools'
brew 'gradle'
brew 'grails'
brew 'graphite2'
brew 'graphviz'
brew 'grpcurl'
brew 'gtk+'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'haskell-stack'
brew 'hdf5'
brew 'helm'
brew 'help2man'
brew 'hicolor-icon-theme'
brew 'htop'
brew 'httpd'
brew 'httpie'
brew 'hub'
brew 'icu4c'
brew 'ilmbase'
brew 'imagemagick'
brew 'imagemagick@6'
brew 'isl'
brew 'jansson'
brew 'jasper'
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'jsoncpp'
brew 'krb5'
brew 'kubernetes-cli'
brew 'lame'
brew 'leptonica'
brew 'libass'
brew 'libbluray'
brew 'libcerf'
brew 'libcroco'
brew 'libdnet'
brew 'libdvdcss'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libiconv'
brew 'libidn2'
brew 'libmagic'
brew 'libmetalink'
brew 'libmpc'
brew 'libogg'
brew 'libpano'
brew 'libpcap'
brew 'libpng'
brew 'librsvg'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libunwind-headers'
brew 'libuv'
brew 'libvidstab'
brew 'libvorbis'
brew 'libvpx'
brew 'libwebsockets'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'little-cms2'
brew 'lua'
brew 'lua@5.1'
brew 'luarocks'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mackup'
brew 'mad'
brew 'make'
brew 'mas'
brew 'maven'
brew 'mecab'
brew 'mecab-ipadic'
brew 'metis'
brew 'mpfr'
brew 'mysql'
brew 'mysql@5.6'
brew 'ncurses'
brew 'neon'
brew 'netcdf'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'ninja'
brew 'nkf'
brew 'nmap'
brew 'node'
brew 'nodebrew'
brew 'nodeenv'
brew 'numpy'
brew 'numpy@1.16'
brew 'oniguruma'
brew 'openblas'
brew 'opencore-amr'
brew 'opencv'
brew 'opencv@2'
brew 'openexr'
brew 'openjdk'
brew 'openjdk@11'
brew 'openjpeg'
brew 'openldap'
brew 'openssl@1.1'
brew 'opus'
brew 'opusfile'
brew 'ossp-uuid'
brew 'p11-kit'
brew 'p7zip'
brew 'pandoc'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'peco'
brew 'pixman'
brew 'pkg-config'
brew 'popt'
brew 'portaudio'
brew 'postgresql'
brew 'postgresql@10'
brew 'postgresql@11'
brew 'protobuf'
brew 'pstree'
brew 'pugixml'
brew 'pyenv'
brew 'pyqt'
brew 'python@3.8'
brew 'python@3.9'
brew 'qt'
brew 'rav1e'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'rsync'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'ruby-build'
brew 'scala'
brew 'sdl2'
brew 'shared-mime-info'
brew 'sip'
brew 'snappy'
brew 'sox'
brew 'spdylay'
brew 'speedtest-cli'
brew 'speex'
brew 'sphinx-doc'
brew 'sqlite'
brew 'srt'
brew 'sshfs'
brew 'suite-sparse'
brew 'swiftlint'
brew 'swig'
brew 'szip'
brew 'tbb'
brew 'telnet'
brew 'terminal-notifier'
brew 'tesseract'
brew 'theora'
brew 'tig'
brew 'tmux'
brew 'torsocks'
brew 'trash'
brew 'tree'
brew 'unbound'
brew 'utf8cpp'
brew 'utf8proc'
brew 'v8'
brew 'v8@3.15'
brew 'vtk'
brew 'w3m'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'wxmac'
brew 'x264'
brew 'x265'
brew 'xmlto'
brew 'xvid'
brew 'xxhash'
brew 'xz'
brew 'yajl'
brew 'yarn'
brew 'youtube-dl'
brew 'zeromq'
brew 'zlib'
brew 'zstd'
brew 'zsync'

tap 'homebrew/bundle'

tap 'homebrew/cask-versions'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'android-studio'
cask 'appcleaner'
cask 'arduino'
cask 'atom'
cask 'boostnote'
cask 'calibre'
cask 'choosy'
cask 'clipy'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'dynalist'
cask 'figma'
cask 'firefox'
cask 'geekbench'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-japanese-ime'
cask 'graphql-playground'
cask 'gyazo'
cask 'handbrake'
cask 'intellij-idea'
cask 'iterm2'
cask 'lastfm'
cask 'libreoffice'
cask 'little-snitch'
cask 'miniconda'
cask 'monolingual'
cask 'ngrok'
cask 'onyx'
cask 'osxfuse'
cask 'phantomjs'
cask 'reveal'
cask 'shadowsocksx-ng'
cask 'snes9x'
cask 'sublime-text'
cask 'supercollider'
cask 'telegram-desktop'
cask 'thunderbird'
cask 'v2rayx'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'
cask 'xquartz'
cask 'zoom'
cask 'zoomus'

tap 'chef/chef'
cask 'chefdk'

tap 'datawire/blackbird'
brew 'telepresence'

tap 'ethereum/ethereum'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'mongodb/brew'
brew 'mongodb-community-shell'
brew 'mongodb-community@3.4'

tap 'petere/postgresql'

tap 'pivotal/tap'
brew 'springboot'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'v2ray/v2ray'
brew 'v2ray-core'

tap 'watsonbox/cmu-sphinx'

tap 'weaveworks/tap'

# Other Homebrew packages
brew 'python@2'
brew 'unrar'
brew 'wpscan'

# Other Cask applications
cask 'brave'
cask 'gitbook-editor'
cask 'java'
cask 'java11'
cask 'nosql-workbench-for-amazon-dynamodb'
cask 'realm-studio'
cask 'station'
cask 'torbrowser'

# App Store applications
mas '1Blocker (3.12.1)', id: 1107421413
mas 'Adblock Plus (2.1.7)', id: 1432731683
mas 'AdBlock Pro (8.1.3)', id: 1018301773
mas 'Battery Monitor (2.4.4)', id: 836505650
mas 'DevCleaner (2.2.0)', id: 1388020431
mas 'ForkLift (2.6.6)', id: 412448059
mas 'GarageBand (10.3.5)', id: 682658836
mas 'Ghostery Lite (1.1.0)', id: 1436953057
mas 'iCompta 6 (6.0.46)', id: 1149778308
mas 'Keeper Password Manager (15.0.13)', id: 414781829
mas 'Keynote (10.3.9)', id: 409183694
mas 'Kindle (1.30.0)', id: 405399194
mas 'LINE (6.5.4)', id: 539883307
mas 'Notability (4.4.3)', id: 736189492
mas 'Numbers (10.3.9)', id: 409203825
mas 'Pages (10.3.9)', id: 409201541
mas 'Pocket (1.8.6)', id: 568494494
mas 'QQ (6.7.3)', id: 451108668
mas 'QQMusic (6.3.5)', id: 595615424
mas 'Save to Pocket (1.1)', id: 1477385213
mas 'Slack (4.12.2)', id: 803453959
mas 'The Unarchiver (4.2.4)', id: 425424353
mas 'WeChat (2.5.0)', id: 836500024
mas 'Xcode (12.3)', id: 497799835
